Tekla.Structures.ModelInternal.PointList
The PointList class defines a type safe point list.

Tekla.Structures.ModelInternal.PointList.Item(System.Int32)
Gets or sets the point at the specified index.
Index: The zero-based index of the element to get or set.

Tekla.Structures.ModelInternal.PointList.Add(Tekla.Structures.Geometry3d.Point)
Adds a new point to the end of the point list.
Value: The point to be added to the list.
Returns: The index where the point was added.

Tekla.Structures.ModelInternal.PointList.Contains(Tekla.Structures.Geometry3d.Point)
Checks if the given point is in the list.
Value: The point to be checked.
Returns: True if the point is in the list, otherwise false.

Tekla.Structures.ModelInternal.PointList.IndexOf(Tekla.Structures.Geometry3d.Point)
Gets the index of the specified point.
Value: The point to locate in the list.
Returns: The index of the point if found in the list, otherwise -1.

Tekla.Structures.ModelInternal.PointList.IndexOf(Tekla.Structures.Geometry3d.Point,System.Int32)
Gets the index of the specified point between the index to start the search
from and the end of the list.
Value: The point to locate in the list.
StartIndex: The index to start the search from.
Returns: The index of the point if found in the list, otherwise -1.

Tekla.Structures.ModelInternal.PointList.IndexOf(Tekla.Structures.Geometry3d.Point,System.Int32,System.Int32)
Gets the index of the specified point between the index to start the search from and StartIndex + Count.
Value: The point to locate in the list.
StartIndex: The index to start the search from.
Count: The number of items searched.
Returns: The index of the point if found in the list, otherwise -1.

Tekla.Structures.ModelInternal.PointList.Insert(System.Int32,Tekla.Structures.Geometry3d.Point)
Inserts the point to the specified index.
Index: The index where the point is inserted.
Value: The point to be inserted.

Tekla.Structures.ModelInternal.PointList.GetRange(System.Int32,System.Int32)
Gets a part of the point list.
Index: The start index of the new list.
Count: The number of items in the new list.
Returns: The new point list.

Tekla.Structures.ModelInternal.PointList.LastIndexOf(Tekla.Structures.Geometry3d.Point)
Searches for the last occurence of the point in the list.
Value: The point to locate.
Returns: The last index of the point if found, otherwise -1.

Tekla.Structures.ModelInternal.PointList.LastIndexOf(Tekla.Structures.Geometry3d.Point,System.Int32)
Searches for the last occurence of the point in the list.
Value: The point to locate.
StartIndex: The index to start the search from.
Returns: The last index of the point if found, otherwise -1.

Tekla.Structures.ModelInternal.PointList.LastIndexOf(Tekla.Structures.Geometry3d.Point,System.Int32,System.Int32)
Searches for the last occurence of the point in the list.
Value: The point to locate.
StartIndex: The index to start the search from.
Count: The number of items searched.
Returns: The last index of the point if found, otherwise -1.

Tekla.Structures.ModelInternal.PointList.Remove(Tekla.Structures.Geometry3d.Point)
Removes the first occurence of the point from the list.
Value: The point to be removed.

Tekla.Structures.ModelInternal.PointList.RemoveRange(System.Int32,System.Int32)
Removes a range of items starting from the given index.
Index: The start index.
Count: The number of items to be removed.

Tekla.Structures.ModelInternal.PointList.ToArray
Copies the points to a point array.
Returns: The array of points.

Tekla.Structures.ModelInternal.PointList.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.